Assignments/Assignment2/convertFahrenheitToCelsius-request.xml

<?xml version="1.0" ?>
<soap:Envelope
    xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    soap:encodingStyle="http://w3.org/2003/05/soap-encoding">

    <!-- omitted header element -->
    
    <soap:Body xmlns:xs="http://www.mockresources.io">
        <!-- request function -->
        <xs:convertFahrenheitToCelsius>125.33</xs:convertFahrenheitToCelsius>
    </soap:Body>
</soap:Envelope>